; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_9 ?v8 ?v12)
             (pred_11 ?v2 ?v13)
             (pred_12 ?v8 ?v13)
             (pred_5 ?v6 ?v8 )
	     (pred_10 ?v8)
             (pred_2 ?v11)
             (pred_1 ?v2)
             (pred_3 ?v13)
             (pred_7 ?v8)
             (pred_8 ?v2)
             (pred_4 ?v8)
             (pred_6 ))



(:action op_5
:parameters (?v9 ?v4 ?v5 ?v10)
:precondition (and (pred_2 ?v9) (pred_2 ?v4) (pred_1 ?v5) (pred_3 ?v10)
          (pred_9 ?v9 ?v4) (pred_11 ?v5 ?v10)
                   (pred_12 ?v4 ?v10) (pred_10 ?v9) 
                   (pred_7 ?v4) (pred_8 ?v5))
:effect (and  (pred_4 ?v4) (not (pred_7 ?v4))))


(:action op_3
:parameters (?v9 ?v7)
:precondition (and (pred_2 ?v9) (pred_2 ?v7)
               (pred_10 ?v9) (pred_9 ?v9 ?v7) (pred_4 ?v7))
:effect (and (pred_10 ?v7) (not (pred_10 ?v9))))

(:action op_1
:parameters (?v9 ?v5)
:precondition (and (pred_2 ?v9) (pred_1 ?v5) 
                  (pred_10 ?v9) (pred_5 ?v5 ?v9) (pred_6 ))
:effect (and (pred_8 ?v5)
   (not (pred_5 ?v5 ?v9)) (not (pred_6 ))))


(:action op_2
:parameters (?v9 ?v3 ?v1)
:precondition (and (pred_2 ?v9) (pred_1 ?v3) (pred_1 ?v1)
                  (pred_10 ?v9) (pred_8 ?v1) (pred_5 ?v3 ?v9))
:effect (and (pred_8 ?v3) (pred_5 ?v1 ?v9)
        (not (pred_8 ?v1)) (not (pred_5 ?v3 ?v9))))

(:action op_4
:parameters (?v9 ?v5)
:precondition (and (pred_2 ?v9) (pred_1 ?v5) 
                  (pred_10 ?v9) (pred_8 ?v5))
:effect (and (pred_6 ) (pred_5 ?v5 ?v9) (not (pred_8 ?v5)))))

; problem
(define (problem grid-2-2-1-1-1)
    (:domain grid)
    (:objects
    obj_05 obj_04 obj_01 obj_02
    obj_03
    obj_06
    )

    (:init
       (pred_6)

       (pred_2 obj_05)
       (pred_2 obj_04)
       (pred_2 obj_01)
       (pred_2 obj_02)
       (pred_3 obj_03)
       (pred_1 obj_06)

       (pred_9 obj_05 obj_01)
       (pred_9 obj_05 obj_04)
       (pred_9 obj_04 obj_02)
       (pred_9 obj_04 obj_05)
       (pred_9 obj_01 obj_02)
       (pred_9 obj_01 obj_05)
       (pred_9 obj_02 obj_04)
       (pred_9 obj_02 obj_01)
       (pred_7 obj_02)
       (pred_12  obj_02 obj_03)
       (pred_4 obj_05)
       (pred_4 obj_04)
       (pred_4 obj_01)

       (pred_11  obj_06 obj_03)
       (pred_5 obj_06 obj_05)
       (pred_10 obj_05)
    )

    (:goal (and
       (pred_5 obj_06 obj_02)
    ))
(:constraints
  (always (not (pred_10 obj_04)))
)
)

; plan
1. (op_1 obj_05 obj_06)
   deleted: (pred_5 obj_06 obj_05) (pred_6)
   added: (pred_8 obj_06)
   goals met: 0 of 1
2. (op_3 obj_05 obj_01)
   deleted: (pred_10 obj_05)
   added: (pred_10 obj_01)
   goals met: 0 of 1
3. (op_5 obj_01 obj_02 obj_06 obj_03)
   deleted: (pred_7 obj_02)
   added: (pred_4 obj_02)
   goals met: 0 of 1
4. (op_3 obj_01 obj_02)
   deleted: (pred_10 obj_01)
   added: (pred_10 obj_02)
   goals met: 0 of 1
5. (op_4 obj_02 obj_06)
   deleted: (pred_8 obj_06)
   added: (pred_6) (pred_5 obj_06 obj_02)
   goals met: 1 of 1
